In [288]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Data Understanding

In [289]:
df = pd.read_csv('housePrice.csv', encoding='ISO-8859-1')

In [290]:
df.head(5)

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1850000000.000,61666.670
1,60,1,True,True,True,Shahran,1850000000.000,61666.670
2,79,2,True,True,True,Pardis,550000000.000,18333.330
3,95,2,True,True,True,Shahrake Qods,902500000.000,30083.330
4,123,2,True,True,True,Shahrake Gharb,7000000000.000,233333.330

In [291]:
df = df.drop("Price", axis = 1)

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3479 entries, 0 to 3478
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Area        3479 non-null   object
 1   Room        3479 non-null   int64
 2   Parking     3479 non-null   bool
 3   Warehouse   3479 non-null   bool
 4   Elevator    3479 non-null   bool
 5   Address     3456 non-null   object
 6   Price(USD)  3479 non-null   float64
dtypes: bool(3), float64(1), int64(1), object(2)
memory usage: 119.0+ KB

In [293]:
df['Area'] = pd.to_numeric(df['Area'], errors='coerce')

In [294]:
df.isnull().sum()

Area           6
Room           0
Parking        0
Warehouse      0
Elevator       0
Address       23
Price(USD)     0
dtype: int64

The number of nulls is much less than 5% of the data, so it is best to delete those rows, as it has little negative impact on the model and the data becomes cleaner.

In [295]:
df = df.dropna()

In [296]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Area,3450.000,106.917,69.551,30.000,69.000,90.000,120.000,929.000
Room,3450.000,2.081,0.760,0.000,2.000,2.000,2.000,5.000
Price(USD),3450.000,179185.420,270863.932,120.000,47308.333,96666.670,200000.000,3080000.000

In [297]:
df['Address'].value_counts()

Address
Punak                     161
Pardis                    146
West Ferdows Boulevard    145
Gheitarieh                140
Shahran                   130
                         ...
Chardangeh                  1
Mehrabad                    1
Pakdasht KhatunAbad         1
Kazemabad                   1
Yakhchiabad                 1
Name: count, Length: 192, dtype: int64

In [298]:
df['Avg_Price'] = df.groupby('Address')['Price(USD)'].transform('mean')
df.sample(8)

,Area,Room,Parking,Warehouse,Elevator,Address,Price(USD),Avg_Price
3097,120.000,2,False,False,False,Mehrabad River River,86666.670,86666.670
1321,108.000,2,True,True,True,Gheitarieh,300000.000,357490.476
1651,120.000,2,True,True,True,West Ferdows Boulevard,166666.670,103524.828
3164,42.000,1,True,False,True,Shahran,58666.670,99525.129
947,56.000,1,True,True,True,Feiz Garden,66666.670,101877.193
1839,120.000,2,True,True,True,Saadat Abad,226666.670,316291.990
720,40.000,1,True,True,True,Andisheh,11666.670,62586.426
1719,125.000,2,True,True,True,Ozgol,310000.000,256423.333